def strange_dict(lst1, lst2):
    """Реализовать функцию, принимающую два списка и возвращающую словарь, упорядоченный по ключам """
    print(dict(zip(sorted(lst1), lst2)) if len(lst1) != len(lst2) else 'Списки равны')

# тестовые данные


letters = [c for c in 'MNOPQRSTABCDEFGHIJKL']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']

strange_dict(letters, morse)


letters_1 = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse_1 = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']

strange_dict(letters_1, morse_1)